***** Task 2
The data from this study has already been saved for you in script.py: the time spent by the 50 visitors to the old version is saved as ~old~; the time spent by visitors to the new version is saved as ~new~. Run a two-sample t-test comparing these groups and save the p-value as ~pval~, then print it out.

#+begin_src python :results output
import pandas as pd
import matplotlib.pyplot as plt
from scipy.stats import ttest_ind
data = pd.read_csv('version_time.csv')

#separate out times for  two versions
old = data.time_minutes[data.version=='old']
new = data.time_minutes[data.version=='new']

#run the t-test here:
tstat, pval = ttest_ind(old, new)
print(pval)

#determine significance
significant = None

#plot overlapping histograms
plt.hist(old, alpha=.8, label='old')
plt.hist(new, alpha=.8, label='new')
plt.legend()
plt.show()

#+end_src

#+RESULTS:
: 0.0020408264429904

***** Task 3
Using a significance threshold of 0.05, is there a significant difference between the average amount of time visitors are spending on the old and new versions of the website? In script.py set the value of ~significant~ equal to ~True~ if there is a significant difference and ~False~ if not.

#+begin_src python :results output
import pandas as pd
import matplotlib.pyplot as plt
from scipy.stats import ttest_ind
data = pd.read_csv('version_time.csv')

#separate out times for  two versions
old = data.time_minutes[data.version=='old']
new = data.time_minutes[data.version=='new']

#run the t-test here:
tstat, pval = ttest_ind(old, new)
print(pval)

#determine significance
significant = True

#plot overlapping histograms
plt.hist(old, alpha=.8, label='old')
plt.hist(new, alpha=.8, label='new')
plt.legend()
plt.show()

#+end_src

#+RESULTS:
: 0.0020408264429904

If the p-value is less than 0.05, we can conclude there is a significant difference.

***** Task Two
At a .05 significance level, does this p-value lead you to reject the null hypothesis (and conclude that at least one pair of stores have significantly different average sales)?

Change the value of significant to True if the p-value indicates at least one pair of stores have significantly different sales and False otherwise.


#+begin_src python :results output
from scipy.stats import ttest_ind, f_oneway
import seaborn as sns
import matplotlib.pyplot as plt
import pandas as pd

# store the data
veryants = pd.read_csv('veryants.csv')
a = veryants.Sale[veryants.Store == 'A']
b = veryants.Sale[veryants.Store == 'B']
c = veryants.Sale[veryants.Store == 'C']

# run t-tests
a_b_tval, a_b_pval = ttest_ind(a,b)
print(a_b_pval)
a_c_tval, a_c_pval = ttest_ind(a,c)
print(a_c_pval)
b_c_tval, b_c_pval = ttest_ind(b,c)
print(b_c_pval)

# determine significance
a_b_significant = True
a_c_significant = True
b_c_significant = False

#ANOVA
fstat, pval = f_oneway(a, b, c)
print("Anova: ", pval)

#ANOVA significance (True or False)
anova_significance = True

# create plot
sns.boxplot(data=veryants, x='Store', y='Sale')
plt.show()
#+end_src

#+RESULTS:
: 2.769886558708305e-05
: 0.02102938693149484
: 0.05986788486166067
: Anova:  0.00015355234908845413

***** Task 2
Inspect the output from the test you just ran. For which pairs of stores did you find a significant difference in average sales?

Assign the values of ~a_b_significant~, ~a_c_significant~ and ~b_c_significant~ to True if the test indicates a significant difference in sales at the indicated pair of stores and False if not.

Recall that when we ran three t-tests, we found significant differences for the A vs. B and A vs. C comparisons. Do we get the same result with this test?

#+begin_quote
*Answer*

Look at the reject column of the output. If reject is True then there is a significant difference between those groups.
#+end_quote

#+begin_src python :results output
from statsmodels.stats.multicomp import pairwise_tukeyhsd
import pandas as pd

# store the data
veryants = pd.read_csv('veryants.csv')

# run tukey's test
tukey_results = pairwise_tukeyhsd(veryants.Sale, veryants.Store, 0.05)
print(tukey_results)

# determine significance
a_b_significant = True
a_c_significant = False
b_c_significant = False
#+end_src

#+RESULTS:
: Multiple Comparison of Means - Tukey HSD, FWER=0.05 
: ====================================================
: group1 group2 meandiff p-adj   lower   upper  reject
: ----------------------------------------------------
:      A      B   7.2763 0.0001  3.2264 11.3263   True
:      A      C    4.011 0.0529 -0.0389  8.0609  False
:      B      C  -3.2653  0.141 -7.3153  0.7846  False
: ----------------------------------------------------

***** Task 2
Code has already been provided for you in the workspace to create an overlaid histogram of these two distributions. Inspect the distributions. Are they approximately normal?

If so, set the value of ~normal_assumption~ equal to True in script.py; otherwise set ~normal_assumption~ equal to False.

Look for things like a multi-modal distribution (multiple ‘humps’), highly skewed data, or outliers. As long as you don’t see any of those things, you can assume that the normality assumption is met.


#+begin_src python :results output
import numpy as np
import matplotlib.pyplot as plt

dist_1 = np.genfromtxt("1.csv")
dist_2 = np.genfromtxt("2.csv")

#calculate ratio of standard deviations:
dist_1_sd = np.std(dist_1)
dist_2_sd = np.std(dist_2)
ratio = dist_1_sd / dist_2_sd
print(ratio)

#check normality assumption
normal_assumption = True

#plot histograms of each distribution
plt.hist(dist_1, alpha = .8, density = True, label = 'dist 1')
plt.hist(dist_2, alpha = .8, density = True, label = 'dist 2')
plt.legend()
plt.show()
#+end_src

#+RESULTS:
: 0.6240550627217001

***** Task 3
Are certain types of ants more popular among specific grades (is there an association between grade and ant type)? Using a significance threshold of 0.05, indicate your answer by changing the value of significant to True if there is a significant association between these variables and False otherwise.

If the p-value is less than 0.05, then there is a significant association between these variables (the ant types differ in popularity across grades), so significant = True. If the p-value is greater than 0.05, significant = False

#+begin_src python :results output
import pandas as pd
from scipy.stats import chi2_contingency

# read in and print data
ants = pd.read_csv("ants_grade.csv")
print(ants.head())

# create contingency table
table = pd.crosstab(ants.Grade, ants.Ant)
print(table)

# run Chi-Square test and print p-value
chi2, pval, dof, expected = chi2_contingency(table)
print(pval)

# determine significance
significant = False
#+end_src

#+RESULTS:
#+begin_example
  Grade          Ant
0   1st    harvester
1   2nd    harvester
2   2nd  leaf cutter
3   1st    harvester
4   3rd  leaf cutter
Ant    harvester  leaf cutter
Grade                        
1st           28            8
2nd           31            5
3rd           23           13
0.08356116834982279
#+end_example

